Процедура ДобавитьФиксАдресаНеИзСписка(ТаблицаАдресов) 

	МассивАдресов = Новый Массив; 
	Соединение = Новый HTTPСоединение("htmlweb.ru",80,,,,20);
	Заголовки = Новый Соответствие; 
	Заголовки.Вставить("Accept","*/*"); 
	Заголовки.Вставить("Connection","keep-alive"); 
	Для Каждого Домен из МассивАдресов Цикл 
		Запрос = Новый HTTPЗапрос("/analiz/api.php?ip&url=" + Домен + "&json",Заголовки); 
		Результат = Соединение.Получить(Запрос); 
		Если Результат.КодСостояния = 200 Тогда 
			НоваяСтрока = ТаблицаАдресов.Добавить(); 
			НоваяСтрока.ip = "";
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Функция ВернутьIPАдресаВФорматеRouterOS() Экспорт
	Соединение = Новый HTTPСоединение("stat.ripe.net",443,,,,220,Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки = Новый Соответствие; 
	Заголовки.Вставить("Accept","*/*"); 
	Заголовки.Вставить("Connection","keep-alive"); 
	Запрос = Новый HTTPЗапрос("data/country-resource-list/data.json?resource=RU",Заголовки); 
	Результат = Соединение.Получить(Запрос); 
	Если Результат.КодСостояния = 200 Тогда 
		Чтение = Новый ЧтениеJSON; 
		Чтение.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
		ОтветJSON = ПрочитатьJSON(Чтение);
		МассивАдресов = ОтветJSON.data.resources.ipv4;
		ЭтотОбъект.ТаблицаIP4.Очистить();
		ТаблицаАдресов = ЭтотОбъект.ТаблицаIP4.Выгрузить(); 
		Для Каждого Адрес Из МассивАдресов Цикл 
			АдресКУстановке = ОбработкаДанныхIPАдресов(Адрес);
			Если НЕ АдресКУстановке = "" Тогда 
				НоваяСтрока = ТаблицаАдресов.Добавить();
				НоваяСтрока.ip = АдресКУстановке;
			КонецЕсли;  
		КонецЦикла; 
		Набор = РегистрыСведений.IpRF.СоздатьНаборЗаписей();
		Набор.Прочитать();
		ДобавитьФиксАдресаНеИзСписка(ТаблицаАдресов); 
		ТаблицаАдресов.Свернуть("ip");
		Набор.Загрузить(ТаблицаАдресов.Скопировать()); 
		Набор.Записать(Истина); 
	КонецЕсли;                       

КонецФункции

Функция ОбработкаДанныхIPАдресов(ip) Экспорт 

	АдресБезПодсети = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ip, "/",Истина,Истина);
	Если СтрДлина(АдресБезПодсети[0]) = СтрДлина(ip) Тогда 
		АдресБезМаски = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(АдресБезПодсети[0],"-",Истина,Истина)[0]; 
	Иначе
		АдресБезМаски = АдресБезПодсети[0];  
	КонецЕсли; 
	МассивЦифрАдреса = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(АдресБезМаски, ".",Истина,Истина);
	Если МассивЦифрАдреса.Количество() <> 4 Тогда 
		Возврат "";
	КонецЕсли; 
	АдресКУстановке = МассивЦифрАдреса[0] + "." + МассивЦифрАдреса[1] + "." + "0" + "." + "0/16"; 
	Возврат АдресКУстановке; 
		
КонецФункции