Функция ПолучитьНастройкиСоединения(ТипОперации, Соединение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоединенияAPIСоединение.Ссылка.Сервер КАК Сервер,
	|	СоединенияAPIСоединение.Ссылка.АдресAPI КАК АдресAPI,
	|	СоединенияAPIСоединение.Ссылка.Порт КАК Порт,
	|	СоединенияAPIСоединение.Ссылка.Логин КАК Логин,
	|	СоединенияAPIСоединение.Ссылка.Пароль КАК Пароль,
	|	СоединенияAPIСоединение.Ссылка.Таймаут КАК Таймаут,
	|	СоединенияAPIСоединение.Ссылка.SSL КАК SSL,
	|	СоединенияAPIСоединение.Ссылка.ПроксиИспользовать КАК ПроксиИспользовать,
	|	СоединенияAPIСоединение.Ссылка.ПортПрокси КАК ПортПрокси,
	|	СоединенияAPIСоединение.Ссылка.АдресПрокси КАК АдресПрокси,
	|	СоединенияAPIСоединение.Суффикс КАК Суффикс
	|ИЗ
	|	Справочник.СоединенияAPI.Соединение КАК СоединенияAPIСоединение
	|ГДЕ
	|	СоединенияAPIСоединение.ТипОперации = &ТипОперации
	|	И СоединенияAPIСоединение.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ТипОперации", ТипОперации);
	Запрос.УстановитьПараметр("Ссылка", Соединение);
	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЗапросУспешен", НЕ РезультатЗапроса.Пустой());
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТабЗнач = Запрос.Выполнить().Выгрузить();
		Для Каждого Колонка из ТабЗнач.Колонки Цикл 
			СтруктураВозврата.Вставить(Колонка.Имя);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ТабЗнач[0]);
	КонецЕсли;
	Возврат СтруктураВозврата;	
	
КонецФункции 


Функция ПолучитьДанныеНаСервере(СсылкаСоединение) Экспорт
	
	СтруктураИЗJSON = Новый Структура;
	Если СсылкаСоединение.ЗапросУспешен Тогда
		HTTP_Соединение = TestRAПовторноИспользуемыеРас.СобратьHTTPСоединение(СсылкаСоединение);
		Результат = HTTP_Соединение.Получить(TestRAПовторноИспользуемыеРас.СобратьHTTPЗапрос(СсылкаСоединение));
		Если Результат.КодСостояния = 200 Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
			СтруктураИЗJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Иначе
			СтруктураИЗJSON = Новый Структура;
		КонецЕсли;
		СтруктураИЗJSON.Вставить("ЗапросУспешен", Результат.КодСостояния = 200);
	Иначе
		СтруктураИЗJSON.Вставить("ЗапросУспешен", СсылкаСоединение.ЗапросУспешен);
	КонецЕсли;
	
	Возврат СтруктураИЗJSON;
	
КонецФункции 






