Функция ВыгрузитьДаныеРегистра_ipRFДляRouterOS() Экспорт
	
	СтрокаВозврата = "/ip firewall address-list" + Символы.ПС; 
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	IpRF.ip КАК ip
	               |ИЗ
	               |	РегистрСведений.IpRF КАК IpRF"; 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СтрокаВозврата = СтрокаВозврата + "add address=" + Выборка.ip + " comment="""" list=ipRF" + Символы.ПС; 
	КонецЦикла; 
	Возврат СтрокаВозврата; 
	
КонецФункции
