
Функция aboutme(Запрос)

	Возврат TestRAМодули.aboutme(Запрос); 

КонецФункции

                                                                   
Функция abouto(Запрос)

	Возврат TestRAМодули.aboutme(Запрос); 
	
КонецФункции


Функция IPRFsendfile(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(TestRAМодули.ВыгрузитьДаныеРегистра_ipRFДляRouterOS(),КодировкаТекста.UTF8); 
	Возврат Ответ;

	Возврат TestRAМодули.ВыгрузитьДаныеРегистра_ipRF(); 
КонецФункции


Функция PipeMessFiles(Запрос)
	
	Возврат TestRAМодули.PipeMessFiles(Запрос); 
	
КонецФункции


Функция GetMessageById(Запрос)
	
	Возврат TestRAМодули.GetMessageById(Запрос);

КонецФункции


Функция SendMessagesend(Запрос)
	
	Возврат TestRAМодули.SendMessage(Запрос);
	
КонецФункции

