
Функция PipeMessFile(Запрос)
	
	Возврат TestRAМодули.PipeMessFile(Запрос); 
	
КонецФункции

Функция aboutme(Запрос)

	Возврат TestRAМодули.aboutme(Запрос); 

КонецФункции

                                                                   
Функция abouto(Запрос)

	Возврат TestRAМодули.aboutme(Запрос); 
	
КонецФункции


Функция IPRFsendfile(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(TestRAМодули.ВыгрузитьДаныеРегистра_ipRFДляRouterOS(),КодировкаТекста.UTF8); 
	Возврат Ответ;

	Возврат TestRAМодули.ВыгрузитьДаныеРегистра_ipRF(); 
КонецФункции

