 Процедура ПровестиДокументы(ДокументСсылка) Экспорт

    Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
        Сообщить("Нет документов для проведения.");
        Возврат;
	КонецЕсли; 

		
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходТовара.Ссылка КАК Ссылка,
	               |	ОрганизацииПользователь.Пользователь КАК Пользователь
	               |ИЗ
	               |	Документ.ПриходТовара КАК ПриходТовара
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.Пользователь КАК ОрганизацииПользователь
	               |		ПО ПриходТовара.Организация = ОрганизацииПользователь.Ссылка
	               |ГДЕ
	               |	ПриходТовара.Ссылка В(&Ссылки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходТовара.Ссылка,
	               |	ОрганизацииПользователь.Пользователь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РасходТовара.Ссылка,
	               |	КонтрагентыПользователь.Пользователь
	               |ИЗ
	               |	Документ.РасходТовара КАК РасходТовара
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.Пользователь КАК КонтрагентыПользователь
	               |		ПО РасходТовара.Контрагент = КонтрагентыПользователь.Ссылка"; 
	Запрос.УстановитьПараметр("Ссылки", ДокументСсылка); 
	Результат = Запрос.Выполнить().Выгрузить(); 
	 Документ = Запрос.Выполнить().Выбрать();
	//Для Каждого Документ Из ДокументСсылка Цикл
	Пока Документ.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Документ) Тогда
		    Продолжить; // Пропустить пустые документы
		КонецЕсли;
        // Заполнение полей записи регистра
		//Результат = Новый ТаблицаЗначений; //результат запроса, заменить - все пользователи организации для ПриходаТоваров
		НайденыСтроки = Результат.НайтиСтроки(Новый Структура("Ссылка", Документ.Ссылка)); 
		Для Каждого Строка ИЗ НайденыСтроки  Цикл
			//Строка  содержит Ссылка - Документ; Пользователь - ссылка спр-к Пользователи из Организации (для Прихода)
			НаборЗаписей = РегистрыСведений.RAСообщения.СоздатьНаборЗаписей();
			//Если ТипЗнач(Документ.Ссылка) = Тип("ДокументСсылка.ПриходТовара") Тогда 
				НаборЗаписей.Отбор.Ссылка.Установить(Строка.Ссылка);
				НаборЗаписей.Отбор.Пользователь.Установить(Строка.Пользователь);
				НаборЗаписей.Прочитать();	
				Если НаборЗаписей.Количество() = 0 Тогда 
					ЗаписьНабора = НаборЗаписей.Добавить(); 
					ЗаписьНабора.Ссылка = Строка.Ссылка; // Ссылка на документ
	        		ЗаписьНабора.GuidСообщения = Строка.Ссылка.УникальныйИдентификатор(); // Генерация нового GUID
	        		ЗаписьНабора.Пользователь = Строка.Пользователь; 
					ЗаписьНабора.ОбменПринят = Ложь;
					ЗаписьНабора.Период = Строка.Ссылка.Дата;
					НаборЗаписей.Записать(Истина); 
				КонецЕсли; 
			//КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;  
	
  
КонецПроцедуры



     