
Функция ВернутьIPАдресаВФорматеRouterOS() Экспорт
	Соединение = Новый HTTPСоединение("stat.ripe.net",443,,,,220,Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки = Новый Соответствие; 
	Заголовки.Вставить("Accept","*/*"); 
	Заголовки.Вставить("Connection","keep-alive"); 
	Запрос = Новый HTTPЗапрос("data/country-resource-list/data.json?resource=RU",Заголовки); 
	Результат = Соединение.Получить(Запрос); 
	Если Результат.КодСостояния = 200 Тогда 
		Чтение = Новый ЧтениеJSON; 
		Чтение.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
		ОтветJSON = ПрочитатьJSON(Чтение);
		МассивАдресов = ОтветJSON.data.resources.ipv4;
		ЭтотОбъект.ТаблицаIP4.Очистить();
		ТаблицаАдресов = ЭтотОбъект.ТаблицаIP4.Выгрузить(); 
		Для Каждого Адрес Из МассивАдресов Цикл 
			АдресБезПодсети = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес,"/",Истина); 
			АдресКУстановке = Адрес; 
			Если СтрДлина(АдресБезПодсети[0]) = СтрДлина(Адрес) Тогда 
				АдресРазбит = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Адрес,"-",Истина); 
				АдресКУстановке = АдресРазбит[0]+"/24"; 
			КонецЕсли; 
			НоваяСтрока = ТаблицаАдресов.Добавить();
			НоваяСтрока.ip = АдресКУстановке; 
		КонецЦикла; 
		Набор = РегистрыСведений.IpRF.СоздатьНаборЗаписей();
		Набор.Прочитать();
		Набор.Загрузить(ТаблицаАдресов.Скопировать()); 
		Набор.Записать(Истина); 
	КонецЕсли;                       

КонецФункции