
&НаСервере
Процедура ПрочитатьСообщениеНаСервере()
	Telegram_Сервер.ПрочитатьСообщенияПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСообщение(Команда)
	ПрочитатьСообщениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗапускОбработчикаОжиданий(Команда)
	 ПодключитьОбработчикОжидания("ОбработчикОжиданияПроцедура",2);
КонецПроцедуры


&НаКлиенте
Процедура ОбработчикОжиданияПроцедура()
	Telegram_Сервер.ПрочитатьСообщенияПользователя();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеПользователямНаСервере()
	    Запрос = Новый Запрос;
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	Telegram_Пользователи.ИмяПользователяТелеграм КАК ИмяПользователяТелеграм,
	                   |	Telegram_Пользователи.ID_Пользователя КАК ID_Пользователя,
	                   |	Telegram_Пользователи.Пользователь КАК Пользователь
	                   |ИЗ
	                   |	РегистрСведений.Telegram_Пользователи КАК Telegram_Пользователи";
	    
	    ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	    Пока ВыборкаЗапроса.Следующий() Цикл
	         Telegram_Сервер.ОтправитьСообщениеПользователюНаСогласование(ВыборкаЗапроса.ID_Пользователя,ТекстСогласования);
	    	
	    КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеПользователям(Команда)
	ОтправитьСообщениеПользователямНаСервере();
КонецПроцедуры
