
&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьНаСервере()
		
	Результат = TestRAМетоды.ПолучитьНастройкиСоединения(ТипОперации, Соединение);
	СтрокаТекста = Новый ТекстовыйДокумент;
	Для Каждого Элемент Из Результат Цикл
		СтрокаТекста.ДобавитьСтроку(Элемент.Ключ + ": " + Элемент.Значение);
    КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеJSON(Команда)
	ПолучитьДанныеJSONНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеJSONНаСервере()
	СсылкаСоединение = TestRAМетоды.ПолучитьНастройкиСоединения(ТипОперации, Соединение);
	СтруктураJSON = TestRAМетоды.ПолучитьДанныеНаСервере(СсылкаСоединение);
	ДанныеСтраницы = Новый ТекстовыйДокумент; 
	Для Каждого Элемент Из СтруктураJSON Цикл
		ДанныеСтраницы.ДобавитьСтроку(Элемент.Ключ + ": " + Элемент.Значение);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМакетHTML(Команда)
	ПолучитьМакетHTMLНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьМакетHTMLНаСервере()
	ТекстМакет = "";
	СсылкаСоединение = TestRAМетоды.ПолучитьНастройкиСоединения(ТипОперации, Соединение);
	СтруктураJSON = TestRAМетоды.ПолучитьДанныеНаСервере(СсылкаСоединение);
	Если СтруктураJSON.ЗапросУспешен Тогда
		Обработка =  РеквизитФормыВЗначение("Объект");
		Макет = Обработка.ПолучитьМакет("МакетHTML");
		ТекстМакет = Макет.ПолучитьТекст();
		ТекстМакет = СтрЗаменить(ТекстМакет, "ТекстJSON", СтруктураJSON.text);
		ТекстМакет = СтрЗаменить(ТекстМакет, "ТекстКартинки", СтруктураJSON.text);
		ТекстМакет = СтрЗаменить(ТекстМакет, "Base64pic", СтруктураJSON.picture); 
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Ошибка JSON");
	КонецЕсли; 
КонецПроцедуры
